/* json structure
 'docType': { 
    'columnSeq': {
        'ï¿½Â»ï¿½Ü±ï¿½ï¿½ï¿?LU)' : {
            'label(L)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 },
            'entry(E)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 }
        },
        'ï¿½ï¿½ï¿½Ï´Ü±ï¿½ï¿½ï¿½(RD)' : {
            'label(L)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 },
            'entry(E)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 }
        }
     }
  },
  'default': { // ï¿½ï¿½ï¿½Ç¿ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½Ï´ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
        'ï¿½Â»ï¿½Ü±ï¿½ï¿½ï¿?LU)' : {
            'label(L)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 },
            'entry(E)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 }
        },
        'ï¿½ï¿½ï¿½Ï´Ü±ï¿½ï¿½ï¿½(RD)' : {
            'label(L)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 },
            'entry(E)': { ï¿½ï¿½ï¿? 0, ï¿½ï¿½ï¿½ï¿½: 0, ï¿½Ï´ï¿½: 0, ï¿½ï¿½ï¿½ï¿½: 0 }
        }
     }
 */

var config = {
    '133': {
        '765': {
            'LU': {
                'L': { up: 0, right: 0, down: 0, left: 0 },
                'E': { up: 0, right: 0, down: 0, left: 0 }
            },
            'RD': {
                'L': { up: 0, right: 0, down: 0, left: 0 },
                'E': { up: 0, right: 0, down: 0, left: 0 }
            }            
        }
    },
    '143': {
        '760': {
            'LU': {
                'L': { up: 0, right: 0, down: 0, left: 0 },
                'E': { up: 5, right: 5, down: 5, left: 5 }
            },
            'RD': {
                'L': { up: 0, right: 0, down: 0, left: 0 },
                'E': { up: 5, right: 5, down: 5, left: 5 }
            }
        },
        '769': {
            'LU': {
                'L': { up: 0, right: 0, down: 0, left: 0 },
                'E': { up: 5, right: 5, down: 5, left: 5 }
            },
            'RD': {
                'L': { up: 0, right: 0, down: 0, left: 0 },
                'E': { up: 5, right: 5, down: 5, left: 5 }
            }
        }
    },
    'default': {
        'LU': {
            'L': { up: 0, right: 0, down: 0, left: 0 },
            'E': { up: 40, right: 70, down: 40, left: 70 }
        },
        'RD': {
            'L': { up: 0, right: 0, down: 0, left: 0 },
            'E': { up: 40, right: 70, down: 40, left: 70 }
        }
    }
};


module.exports = config;

